import { Box, Text } from '@chakra-ui/react';
import styled from '@emotion/styled';
import { FadeInAnimation } from 'components/Elements';
import { ContentWrapper } from 'components/Layouts';
import { FC } from 'react';

export const PrivacyPolicyMain: FC = () => {
  return (
    <ContentWrapper bgType="white">
      <FadeInAnimation>
        <Box>
          <Text fontSize={{ base: 'xl', xl: '2xl' }} fontWeight="bold">
            はじめに
          </Text>
          <Text>
            株式会社Scrumy（以下「当社」といいます。）が提供するScrumyは、ソフトウェア開発業務を効率化するプラットフォームです。
            <br />
            当社は、ユーザーのデータ保護・情報セキュリティを極めて重要な課題と認識し、ユーザーのデータの保護・情報セキュリティの確保に取り組んでいます。
            <br />
            当社は、ユーザーのデータ保護を徹底するために、個人情報の保護に関する法律（以下「個人情報保護法」といいます。）及びガイドライン等の規範（以下「個人情報関連法令等」といいます。）を遵守し、Scrumyを通じて当社に提供されたユーザーの個人情報等に関して、このプライバシーポリシー（以下「本方針」といいます。）を定めます。
          </Text>
        </Box>
        <Typograpy>
          <section>
            <h2>第1章 総則</h2>
            <section>
              <h3>1. 定義</h3>
              <ol>
                <li>
                  ⑴本方針において、個人情報とは、個人情報保護法第2条第1項に定める情報とします。
                </li>
                <li>
                  ⑵本方針において、履歴情報及び属性情報とは、個人に関する情報であったとしても、単独では特定の個人を識別することができない情報を指します。弊社は、履歴情報及び属性情報等の具体例としては、クッキー（※1）、IPアドレス情報、ウェブサイト及びアプリの閲覧履歴、行動履歴及び購買履歴、端末ID、ユーザーエージェント（※2）、リファラ（※3）、属性等の類推情報等（性別、年齢、閲覧履歴、行動履歴及び購買履歴、モバイル端末向けの広告ID、位置情報等を分析して、ユーザーの属性及び趣向等を当社で独自に類推した情報をいいます。以下同じ。）を想定しています。
                </li>
              </ol>
            </section>
            <section>
              <h3>2. 法令・規範の遵守</h3>
              <p>
                当社は、個人情報保護関連法令等を遵守するとともに、本方針を含む当社の個人情報保護に関する規則を個人情報関連法令等に適合致します。
              </p>
            </section>
            <section>
              <h3>3. 個人情報等の管理について</h3>
              <ol>
                <li>
                  ⑴当社は、個人情報、履歴情報及び属性情報（以下「個人情報等」といいます。）を正確かつ最新の内容に保つよう努めるとともに、不正なアクセス、改ざん、漏えい、滅失及び毀損から保護するため、必要かつ適切な安全管理措置を講じます。
                </li>
                <li>
                  ⑵当社は、Scrumyで取扱う情報に対するセキュリティ管理には細心の注意を払います。
                </li>
                <li>
                  ⑶当社は、従業員の中でも業務遂行上必要な者しか個人情報等にアクセスできないように制限を定めております。また、従業員に個人情報等を取り扱わせる際には、個人情報等の安全管理が図られるよう、従業員に対する必要かつ適切な監督を行います。
                </li>
              </ol>
            </section>
          </section>
          <section>
            <h2>第2章 個人情報の取扱い方針</h2>
            <section>
              <h3>4. 個人情報の収集の制限</h3>
              <ol>
                <li>
                  ⑴当社は、Scrumyを通じて、ユーザーの名前、住所、勤務先、メールアドレス等の個人情報をユーザーから直接収集することはありません。
                </li>
                <li>
                  ⑵当社は、パートナー（Scrumyを利用している企業をいいます。以下同じ。）がScrumyを利用する際、当該パートナーとScrumy利用契約を締結し、当該パートナーがScrumyの利用に際して必要な範囲内で、個人情報の取扱いに関する業務の委託を受けます。当社は、当該業務の委託の範囲内で、個人情報を取扱うことがあります。
                </li>
              </ol>
            </section>
            <section>
              <h3>5. 個人情報の利用目的</h3>
              <p>
                当社は、パートナーからの個人情報の取扱いに関する業務の委託の範囲内で、ユーザーの個人情報を下記の目的のために使用することがあります。
              </p>
              <br />
              <ol>
                <li>
                  ⑴当社及びパートナーがユーザーの属性や趣向等を分析し、当該属性や趣向等に最適化されたコンテンツ、広告等の表示、電子メール、SMS、オンラインチャット、ブラウザ上での通知等の方法でメッセージ送信を行うこと。
                </li>
                <li>
                  ⑵当社及びパートナーに対する問い合わせ内容の正確な把握及び回答、情報の送付等の連絡。
                </li>
                <li>⑶ユーザーの不正行為の監視。</li>
                <li>
                  ⑷属性等の類推情報及び統計情報の作成。なお、当社は、当該情報を作成する際には、特定の個人が識別されないように、匿名化措置を講じます。
                </li>
                <li>
                  ⑸パートナーがパートナーサービス上の来訪者の行動を再生する機能を利用する場合に、システム上の問題の原因の特定その他のパートナー提供サービスの改善のために必要なデータの閲覧、記録及び分析を行うこと。
                </li>
              </ol>
            </section>
            <section>
              <h3>6. 個人情報の第三者提供の禁止</h3>
              <p>
                当社は、次に掲げる場合を除き、ユーザー本人の同意を得ないで、当社の取扱う個人情報を第三者に対して開示又は提供を行いません。
              </p>
              <br />
              <ol>
                <li>
                  ⑴法令に基づく場合その他個人情報保護法第23条第1項各号の定めに従いユーザー本人の同意を得ないで個人情報の第三者提供が許容される場合。
                </li>
                <li>
                  ⑵前項の利用目的の達成に必要な範囲内において、個人情報の取扱い業務を全部又は一部を委託する場合。
                </li>
                <li>
                  ⑶合併その他の事由による事業の承継に伴って個人情報が提供される場合。
                </li>
              </ol>
            </section>
            <section>
              <h3>7. 当社が個人情報に関する業務を受託する際の方針</h3>
              <ol>
                <li>
                  ⑴当社は、本方針に従い、善良なる管理者の注意をもって、パートナーから委託を受けた個人情報に関する業務を実施します。当社は、個人情報に関する業務の委託を受ける際、パートナーに対して、当該業務委託の対象となる個人情報が適法、適切な方法によって取得されたものであること、当該個人情報の提供が適用法令等（外国法を含みます。）に違反しないこと、及び第三者の権利を侵害しないことを求めています。
                </li>
                <li>
                  ⑵当社は、パートナーと締結する利用契約（以下「Scrumy利用契約」といいます。）において、当該個人情報に関する業務の委託範囲や目的等を明確にし、委託の趣旨に従って適切に取扱いを行なうこととします。当社は、パートナーからの個人情報に関する業務の委託範囲を超えて、ユーザーの個人情報を取り扱いません。
                </li>
                <li>
                  ⑶当社は、委託を受けた個人情報の取扱いに関する業務に関して、委託者であるパートナーの必要かつ適切な監督を適宜受けます。
                </li>
              </ol>
            </section>
            <section>
              <h3>8. 委託先の監督</h3>
              <p>
                当社は、第6項の目的を達成するために、当社に対するパートナーの個人情報に関する業務の委託の範囲内で、当該業務の全部又は一部を第三者（例えば、外部のメール配信事業者等）に対して委託する場合があります。当社は、この場合、第三者の選定は個人情報保護の観点から適切に行い、委託先と機密保持を含む契約を締結し、委託先において個人情報の安全管理が図られるよう、必要かつ適切な監督を行います。
              </p>
            </section>
            <section>
              <h3>9. 個人情報の削除</h3>
              <p>
                当社はScrumy利用契約が終了した場合、個人情報に関する業務の受託に伴いパートナーから提供を受けた個人情報は、当該Scrumy利用契約終了後90日以内に削除します。
              </p>
            </section>
            <section>
              <h3>10. 個人情報の開示及び訂正等</h3>
              <p>
                当社は、当社お問い合わせ先に対して、ユーザーご本人により、個人情報の開示、訂正、削除、利用の停止等（以下「開示等」といいます。）の申し出があった場合、当社所定の書類をご提出頂きご本人であることを確認させていただいた上で、合理的な期間で調査を行い、法令の定めに従って対応致します。なお、この場合、当社所定の手数料がかかりますのでご了承ください。
              </p>
            </section>
          </section>
          <section>
            <h2>第3章 履歴情報及び属性情報の取扱い方針</h2>
            <section>
              <h3>11. 履歴情報及び属性情報の収集</h3>
              <ol>
                <li>
                  ⑴当社は、パートナーに対するScrumyのサービス提供に際して、パートナーの運営するウェブサイト及びアプリを訪問したユーザーの履歴情報及び属性情報を収集します。なお、当社が閲覧履歴、行動履歴、購買履歴等の情報を参照するために発行するクッキーでは、ユーザーを特定することはできません。また、当社がクッキーを保持し、履歴情報及び属性情報の収集を継続する期間は、ユーザーが当該コンピュータ端末等を用い対象ウェブサイトに最後にアクセスした日から最長で2年間とします。
                </li>
                <li>
                  ⑵当社は、広告ネットワーク等を運営する第三者から、履歴情報及び属性情報を収集することがあります。
                </li>
              </ol>
            </section>
            <section>
              <h3>12. 履歴情報及び属性情報の利用目的</h3>
              <p>
                当社は、ユーザーの履歴情報及び属性情報を下記の目的のために利用することがあります。
              </p>
              <ol>
                <li>⑴第5項各号で定める目的。</li>
                <li>
                  ⑵当社及びパートナーのサービス、広告及びマーケティングに関する効果の測定・改善。
                </li>
                <li>⑶市場分析及びマーケティング。</li>
                <li>⑷当社のサービスの改善や新サービスの開発等。</li>
              </ol>
            </section>
            <section>
              <h3>13. 履歴情報及び属性情報の第三者提供の禁止</h3>
              <p>
                当社が、当社の収集した履歴情報及び属性情報を第三者に対して開示又は提供する場合、当該情報を収集したウェブサイト及びアプリを運営するパートナーのプライバシーポリシーに従うものとします。但し、第6項各号に定める場合又はユーザー本人の同意がある場合は、この限りではありません。
              </p>
            </section>
            <section>
              <h3>14. 委託先の監督</h3>
              <p>
                当社は、第12
                項の目的を達成するために、履歴情報及び属性情報の取扱いに関する業務の全部又は一部を第三者に対して委託する場合があります。当社は、この場合、第三者の選定は履歴情報及び属性情報の保護の趣旨の観点から適切に行い、委託先と機密保持を含む契約を締結し、委託先において履歴情報及び属性情報の安全管理が図られるよう、必要かつ適切な監督を行います。
              </p>
            </section>
            <section>
              <h3>15. 履歴情報及び属性情報の収集の停止等</h3>
              <ol>
                <li>
                  ⑴当社は、ユーザーの履歴情報及び属性情報の当社による収集を停止する手段を提供します。この収集の停止設定がされた場合、当社は、一切のユーザーの履歴情報及び属性情報を収集いたしません。
                </li>
                <li>
                  ⑵前項の履歴情報及び属性情報の収集の停止は、ユーザーのご利用のブラウザや端末ごとに行なう必要があります。また、前項の手段による履歴情報及び属性情報の収集の停止設定以降、当社は、履歴情報及び属性情報を収集致しませんが、クッキーの削除やPCその他の端末の設定変更等によりこの設定が無効化されると、再度収集を開始する場合がありますのでご注意ください。
                </li>
              </ol>
            </section>
          </section>
          <section>
            <h2>第4章 補足</h2>
            <section>
              <h3>16. 本方針の継続的改善</h3>
              <p>
                当社は、個人情報等の適切な取扱いを維持するために、本方針について随時見直しを加え、個人情報等の取扱い体制、運用方法を時代の要請に合うよう継続的に改善してまいります。また、個人情報関連法令が制定され、更に改正された場合には、都度、その内容に沿った体制を構築してまいります。
              </p>
            </section>
            <section>
              <h3>17. 本方針の変更</h3>
              <p>
                当社は、ユーザーの事前の承諾を得ることなく、随時本方針の内容を変更することができるものとします。当社が本方針を変更した場合、その変更を本方針及び当社のウェブサイトにおける適切と思われる場所に掲示致します。
                <br />
                前項の変更は、変更後の内容等を当社が当社のウェブサイト上で掲示し、１週間経過時点で、変更後の内容が適用されるものとします。
              </p>
            </section>
            <section>
              <h3>18. お問い合わせ</h3>
              <p>
                当社の本方針及び個人情報の開示等に関するお問い合わせは、下記までお願い致します。
              </p>
              <address>
                <p>株式会社Scrumy</p>
                <p>〒104-0061</p>
                <p>東京都中央区銀座一丁目22番11号2F</p>
                <p>Mail: info@scrumy.co.jp</p>
              </address>
              <p>【注記】</p>
              <ol>
                <li>
                  （※1）「クッキー」とは、ウェブサイトを訪問したユーザーについて、個人を特定することなく、当該ユーザーが用いたコンピュータ端末等を識別するテキストファイルを指します。クッキーは、ユーザーの利用するブラウザを通じて、コンピュータ等の記憶装置に保存されます。クッキーはユーザー自身を特定することなく、閲覧履歴情報等を参照し、その情報を基に、ウェブサイトの運営や改善、コンテンツ（文字、音、画像、映像又はソフトウェアを含みます。）の最適化等に役立てるために、現在、多数のウェブサイトで一般的に使用されている技術です。
                </li>
                <li>
                  （※2）「ユーザーエージェント」とは、個人を特定することなく、ブラウザや利用端末の判別を行なうためにブラウザが自動的に送信する情報を指します。
                </li>
                <li>
                  （※3）「リファラ」とは、ある特定のウェブページのリンクから別のページに移動した際にブラウザが自動的に送信するリンク元のページのURLを指します。
                </li>
              </ol>
            </section>
          </section>
        </Typograpy>
        <Box mt={6} fontWeight="bold">
          <Text>制定日 令和3年12月1日</Text>
          <Text>株式会社Scrumy 代表取締役</Text>
          <Text>笹埜 健斗</Text>
        </Box>
      </FadeInAnimation>
    </ContentWrapper>
  );
};

export const Typograpy = styled(Box)`
  margin-top: 24px;
  section + section {
    margin-top: 24px;
  }
  h2 {
    font-size: 20px;
    font-weight: bold;
    @media (min-width: 1280px) {
      font-size: 24px;
    }
  }
  h3 {
    font-size: 18px;
    font-weight: bold;
    @media (min-width: 1280px) {
      font-size: 20px;
    }
  }
  address {
    padding-left: 1em;
  }
`;
