export const SERVICE_LIST = [
  {
    title: 'ESG戦略コンサルティング「Scrumy-Support」',
    title_en: 'Scrumy-Support',
    title_ja: 'ESG戦略コンサルティング',
    image: '/images/root/root_service_image01.png',
    text1:
      '企業は環境、社会、ガバナンスと向き合う「サステナブル経営」が求められる時代になりました。しかし、実態を伴わないサステナビリティの標榜は「SDGs/ESGウォッシュ」として、社会的非難（今後は法的制裁）を受ける非常に大きなリスクとなってしまいます。',
    text2:
      'Scrumy-Supportでは、サステナビリティをコア概念に新時代の経営戦略を開発し続けています。サステナビリティ学者をはじめとする各種人材が揃う専門家集団として、最新の研究成果や国際基準SASB/ISSBに基づき、サステナビリティ・トランスフォーメーション（SX）のための戦略コンサルティングサービスを提供しています。',
  },
  {
    title: 'SXディスクロージャーツール「Scrumy-Code」',
    title_en: 'Scrumy-Code',
    title_ja: 'SXディスクロージャーツール',
    image: '/images/root/root_service_image02.png',
    text1:
      '日本には伝統ある素晴らしい企業が数多く存在します。財務情報に加え、知的財産などの非財務情報を、最新の国内外のルールメイキングの動向を踏まえたうえで適切に開示することで、国内外の投資家などからの評価を根拠を伴って飛躍的に高めることができます。',
    text2:
      'Scrumy-Codeでは、国内・海外投資家に通用するサステナビリティ情報開示を行うために欠かせない、SASB/ISSBをはじめとした国際ESG情報開示基準、MSCIをはじめとした国際ESG評価基準、国内外のアカデミアレポート、国際基準策定機関や政府機関の議事録などの重要情報を絶えず学習させ続けているSXデータベースです。',
  },
];
